; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	image0 - mode
	thermograph2 - mode
	thermograph3 - mode
	infrared1 - mode
	Star3 - direction
	GroundStation5 - direction
	Star6 - direction
	Star8 - direction
	Star9 - direction
	Star4 - direction
	Star2 - direction
	GroundStation0 - direction
	Star7 - direction
	Star1 - direction
	Star10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Planet13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star4)
	(supports instrument1 image0)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 infrared1)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument3 thermograph2)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star7)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 image0)
	(calibration_target instrument4 Star1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
)
(:goal (and
	(pointing satellite1 GroundStation0)
	(have_image Star10 infrared1)
	(have_image Phenomenon11 image0)
	(have_image Star12 thermograph3)
	(have_image Planet13 image0)
	(have_image Phenomenon14 image0)
))

)

; plan
1. (turn_to satellite1 star1 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star1)
   goals met: 0 of 6
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 6
3. (calibrate satellite1 instrument4 star1)
   added: (calibrated instrument4)
   goals met: 0 of 6
4. (turn_to satellite1 phenomenon11 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 phenomenon11)
   goals met: 0 of 6
5. (turn_to satellite0 star2 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star2)
   goals met: 0 of 6
6. (take_image satellite1 phenomenon11 instrument4 image0)
   added: (have_image phenomenon11 image0)
   goals met: 1 of 6
7. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 1 of 6
8. (calibrate satellite0 instrument2 star2)
   added: (calibrated instrument2)
   goals met: 1 of 6
9. (turn_to satellite0 star10 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star10)
   goals met: 1 of 6
10. (take_image satellite0 star10 instrument2 infrared1)
   added: (have_image star10 infrared1)
   goals met: 2 of 6
11. (turn_to satellite0 star12 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star12)
   goals met: 2 of 6
12. (take_image satellite0 star12 instrument2 thermograph3)
   added: (have_image star12 thermograph3)
   goals met: 3 of 6
13. (turn_to satellite1 phenomenon14 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 phenomenon14)
   goals met: 3 of 6
14. (take_image satellite1 phenomenon14 instrument4 image0)
   added: (have_image phenomenon14 image0)
   goals met: 4 of 6
15. (turn_to satellite1 planet13 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 planet13)
   goals met: 4 of 6
16. (take_image satellite1 planet13 instrument4 image0)
   added: (have_image planet13 image0)
   goals met: 5 of 6
17. (turn_to satellite1 groundstation0 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 groundstation0)
   goals met: 6 of 6
